In [13]:
import pandas as pd
import glob
import sqlalchemy
from sqlalchemy import create_engine
import psycopg2 as pg
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
import pandas.io.sql as psql
import datetime as dt
import sys
import pymysql

# create engine for load data from pandas
engine = create_engine('postgresql://operator:Mimoza2019@192.168.55.55:5432/anamnez_gtd')
pgdbConnection    = engine.connect()

#connection to use with raw sql
connection = pg.connect("host='192.168.55.55' dbname=anamnez_gtd user=operator password='Mimoza2019'")
connection.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT);
cursor = connection.cursor()

In [ ]:
#  TRUNCATE ALL TABLES (uncomment)
tables= ["records","nl_reestr","nl_credit","organisation","trademark","sender","country","exchange","tm_alias"]
for t in tables:
    sql_command = "TRUNCATE " + t + " RESTART IDENTITY CASCADE;"
    print(sql_command)
#    cursor.execute(sql_command)
#    connection.commit()

In [30]:
%%time
table_name = 'exchange'
mysqlEngine = create_engine('mysql+pymysql://operator:Mimoza2019@192.168.58.251/anamnez_gtd', pool_recycle=3600)
mydbConnection    = mysqlEngine.connect()
sql_command = " TRUNCATE " + table_name + "_tmp RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
df_exchange = pd.read_sql('SELECT cm.date,cf.`EUR-COM`,cf.`EUR-NBU`,cf.`USD-COM`,cf.`USD-NBU`,cm.mb_eur_buy AS `EUR-MB-BUY`,cm.mb_eur_sale AS `EUR-MB-SALE` FROM courses_mb AS cm LEFT JOIN courses_full AS cf ON cf.DATE=cm.date', con=mydbConnection)
print(max(df_exchange['date']))
df_exchange.drop_duplicates(inplace=True)
df_exchange.to_sql(table_name+"_tmp", engine, if_exists='replace',index=False) # commented cause wrong default column types
df_exchange.shape
sql_command = " insert into " + table_name + " SELECT EUR-COM,EUR-NBU,USD-COM,USD-NBU,EUR-MB-BUY,EUR-MB-SALE,date FROM "+table_name+"_tmp"
print(sql_command)
#cursor.execute(sql_command)
#connection.commit()

 TRUNCATE exchange_tmp RESTART IDENTITY CASCADE;
2020-08-16
 insert into exchange SELECT EUR-COM,EUR-NBU,USD-COM,USD-NBU,EUR-MB-BUY,EUR-MB-SALE,date FROM exchange_tmp
CPU times: user 231 ms, sys: 97.8 ms, total: 329 ms
Wall time: 843 ms

In [ ]:
%%time
table_name = 'tm_alias'
mysqlEngine = create_engine('mysql+pymysql://operator:Mimoza2019@192.168.58.251/anamnez_gtd', pool_recycle=3600)
mydbConnection    = mysqlEngine.connect()
df_tmalias = pd.read_sql('select * from sender_trademark', con=mydbConnection)
df_tmalias.to_sql(table_name, engine, if_exists='replace',index=False)

In [ ]:
%%time
table_name = 'country'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "insert into "+table_name+" (\"name\") select distinct upper(trim(country)) as country from records_staging where country IS NOT NULL ORDER BY country";
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'sender'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + "(name,country_id) select distinct UPPER(TRIM(sender_name))::varchar as \"name\",country.id::bigint as \"country_id\" from records_staging LEFT JOIN country ON country.name = upper(trim(records_staging.country)) WHERE \"name\" IS NOT NULL ORDER BY \"name\""
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'trademark'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO "+table_name+"(name, sender_id) select distinct UPPER(TRIM(trademark))::varchar as \"name\",s.id::bigint as \"sender_id\" from records_staging as r LEFT JOIN country as c ON upper(trim(r.country)) = c.name LEFT JOIN sender as s ON s.name = upper(trim(r.sender_name)) and s.country_id = c.id WHERE length(trademark) > 1 ORDER BY \"name\""
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'organisation'
mysqlEngine = create_engine('mysql+pymysql://operator:Mimoza2019@192.168.58.251/anamnez_gtd', pool_recycle=3600)
mydbConnection    = mysqlEngine.connect()
df_competitors = pd.read_sql('SELECT * FROM `competitors`', con=mydbConnection)
df_competitors.to_sql("competitors", engine, if_exists='replace',index=False)
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + "(name, edrpou, is_competitor) select distinct MIN(UPPER(TRIM(recipient_name)))::varchar as \"name\", recipient_code as edrpou, case when recipient_code in (SELECT competitor_code from competitors) then TRUE else FALSE end as is_competitor from records_staging WHERE length(recipient_name) > 1 AND recipient_code is not null group by recipient_code order by recipient_code"    
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [12]:
%%time
table_name = 'tnved_group'
mysqlEngine = create_engine('mysql+pymysql://operator:Mimoza2019@192.168.58.251/anamnez_gtd', pool_recycle=3600)
mydbConnection    = mysqlEngine.connect()
df_groupcodes = pd.read_sql('SELECT * FROM `groupcodes`', con=mydbConnection)
df_groupcodes.head()
df_groupcodes.to_sql(table_name, engine, if_exists='replace',index=False)
#sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
#print(sql_command)
#cursor.execute(sql_command)
#connection.commit()
#sql_command = "INSERT INTO " + table_name + "(gcodes,gname) select gcodes::integer,gname from "+table_name+"_tmp"    
#print(sql_command)
#cursor.execute(sql_command)
#connection.commit()
#print("Done.")

CPU times: user 64.1 ms, sys: 5.36 ms, total: 69.5 ms
Wall time: 149 ms

In [2]:
%%time

#Wall time: 11min 48s
table_name = 'gtd'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO  " + table_name + " (date,name,product_code,description,trademark_id,cost_fact,cost_customs) SELECT * FROM (SELECT r.DATE AS date, REPLACE(TRIM(r.gtd), ' ', '') AS name, r.product_code AS product_code, r.description AS description, T.ID AS trademark_id, r.cost_fact AS cost_fact, r.cost_customs AS cost_customs FROM records_staging AS r LEFT JOIN country AS C ON UPPER (TRIM (r.country))=C.NAME LEFT JOIN sender AS s ON UPPER (TRIM (r.sender_name))=s.NAME AND s.country_id=C.ID LEFT JOIN organisation AS o ON o.edrpou=r.recipient_code::text LEFT JOIN trademark AS T ON T.NAME=UPPER (TRIM (r.trademark)) AND T.sender_id=s.ID AND s.country_id=C.ID ORDER BY date) as TT where trademark_id is not null"   
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

TRUNCATE gtd RESTART IDENTITY CASCADE;
INSERT INTO  gtd (date,name,product_code,description,trademark_id,cost_fact,cost_customs) SELECT * FROM (SELECT r.DATE AS date, REPLACE(TRIM(r.gtd), ' ', '') AS name, r.product_code AS product_code, r.description AS description, T.ID AS trademark_id, r.cost_fact AS cost_fact, r.cost_customs AS cost_customs FROM records_staging AS r LEFT JOIN country AS C ON UPPER (TRIM (r.country))=C.NAME LEFT JOIN sender AS s ON UPPER (TRIM (r.sender_name))=s.NAME AND s.country_id=C.ID LEFT JOIN organisation AS o ON o.edrpou=r.recipient_code::text LEFT JOIN trademark AS T ON T.NAME=UPPER (TRIM (r.trademark)) AND T.sender_id=s.ID AND s.country_id=C.ID ORDER BY date) as TT where trademark_id is not null
Done.
CPU times: user 35.9 ms, sys: 14.1 ms, total: 50 ms
Wall time: 11min 48s

In [ ]:
%%time
#  Time: 2649,328s

table_name = 'records'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + " (sender_id,recipient_id,gtd_id) SELECT s.ID AS sender_id,o.ID AS recipient_id,G.ID AS gtd_id FROM records_staging AS rs LEFT JOIN country C ON UPPER (TRIM (rs.country))=C.NAME LEFT JOIN sender AS s ON UPPER (TRIM (rs.sender_name))=s.NAME AND s.country_id=C.ID LEFT JOIN trademark AS T ON T.NAME=UPPER (TRIM (rs.trademark)) AND T.sender_id=s.ID AND s.country_id=C.ID LEFT JOIN organisation AS o ON o.edrpou=rs.recipient_code :: TEXT LEFT JOIN gtd G ON rs.gtd=G.NAME AND o.edrpou=rs.recipient_code :: TEXT AND rs.product_code=G.product_code AND G.DATE=rs.DATE AND G.cost_fact=rs.cost_fact AND G.cost_customs=rs.cost_customs AND UPPER (TRIM (G.description))=UPPER (TRIM (rs.description)) AND T.NAME=UPPER (TRIM (rs.trademark)) AND UPPER (TRIM (rs.sender_name))=s.NAME AND UPPER (TRIM (rs.country))=C.NAME"
print(sql_command)
#cursor.execute(sql_command)
#connection.commit()
#print("Done.")

NALOG PART
--------

In [ ]:
%%time
table_name = 'nl_product'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + " (NAME) SELECT DISTINCT product_name AS NAME FROM (SELECT DISTINCT product_name FROM credit_staging UNION SELECT DISTINCT product_name FROM reestr_staging) AS p ORDER BY NAME"  
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'nl_org'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + " (edrpou,NAME) SELECT DISTINCT o.edrpou :: BIGINT AS edrpou,MIN (NAME) AS NAME FROM (SELECT DISTINCT seller_edrpou AS edrpou,seller_name AS NAME FROM credit_staging UNION SELECT DISTINCT seller_edrpou AS edrpou,seller_name AS NAME FROM reestr_staging UNION SELECT DISTINCT buyer_edrpou AS edrpou,buyer_name AS NAME FROM reestr_staging UNION SELECT DISTINCT buyer_edrpou AS edrpou,buyer_name AS NAME FROM credit_staging) AS o GROUP BY edrpou ORDER BY edrpou"  
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'nl_credit'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO " + table_name + " (doc_id,reestr_number,ordering_date,unit,one_product_cost,count,product_id,seller_id,buyer_id) SELECT s.doc_id :: BIGINT AS doc_id,s.reestr_number :: BIGINT AS reestr_number,s.ordering_date,s.unit,s.one_product_cost :: DOUBLE PRECISION AS one_product_cost,s.count:: DOUBLE PRECISION AS count,p.id AS product_id,os.id AS seller_id,ob.id AS buyer_id FROM credit_staging AS s LEFT JOIN nl_product AS p ON s.product_name=p.NAME LEFT JOIN nl_org AS os ON os.edrpou=s.seller_edrpou :: BIGINT LEFT JOIN nl_org AS ob ON ob.edrpou=s.buyer_edrpou :: BIGINT WHERE count not LIKE '%E%' ORDER BY ordering_date DESC"  
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")

In [ ]:
%%time
table_name = 'nl_reestr'
sql_command = "TRUNCATE " + table_name + " RESTART IDENTITY CASCADE;"
print(sql_command)
cursor.execute(sql_command)
connection.commit()
sql_command = "INSERT INTO nl_reestr (doc_id,reestr_number,ordering_date,unit,one_product_cost,count,product_id,seller_id,buyer_id) SELECT r.doc_id::BIGINT AS doc_id,r.reestr_number :: BIGINT AS reestr_number,r.ordering_date :: date,r.unit,r.one_product_cost :: DOUBLE PRECISION AS one_product_cost,r.count:: DOUBLE PRECISION AS count,p.id AS product_id,os.id AS seller_id,ob.id AS buyer_id FROM reestr_staging AS r LEFT JOIN nl_product AS p ON r.product_name=p.NAME LEFT JOIN nl_org AS os ON os.edrpou=r.seller_edrpou :: BIGINT LEFT JOIN nl_org AS ob ON ob.edrpou=r.buyer_edrpou :: BIGINT WHERE count not LIKE '%E%'"  
print(sql_command)
cursor.execute(sql_command)
connection.commit()
print("Done.")